package com.dorontayar.recycleviewpijamot;

public class PijamotData {
    static String[] nameArray = {"Alona Tal", "Dana Frider", "Ilan Rosenfeld", "Kobi Paraj", "Nadav Assulin",
            "Nir Ron", "Oded Paz", "Yaniv Polishuk", "Revka Gor", "Yamit Sol", "Yuval Segal"};

    static Integer[] drawableArray = {R.drawable.alona_tal, R.drawable.dana_frider, R.drawable.ilan_rosenfeld,
            R.drawable.kobi_paraj, R.drawable.nadav_assulin, R.drawable.nir_ron, R.drawable.oded_paz,
            R.drawable.yaniv_polishuk, R.drawable.revka_gor, R.drawable.yamit_sol, R.drawable.yuval_segal};

    static String[] descriptionArray = {
            "אלונה טל-פרז (נולדה ב-20 באוקטובר 1983, י\"ג בחשוון ה'תשמ\"ד) היא שחקנית קולנוע וטלוויזיה ישראלית-אמריקאית בעלת קריירה בינלאומית. ידועה בשל משחקה בסדרות \"הפיג'מות\", \"ילדי ראש הממשלה\", \"על טבעי\", \"ורוניקה מארס\" ו\"אריות הים\".",
            "דנה פרידר (נולדה ב-19 בפברואר 1987) היא רקדנית, שחקנית, דוגמנית, זמרת ומנחת טלוויזיה ישראלית. זוכת שני פרסי טקס נבחרי הילדים בקטגוריית \"שחקנית השנה\" ב-2010 וב-2011.",
            "אילן רוזנפלד (נולד ב-10 בינואר 1980 כ\"א בטבת ה'תש\"ם) הוא שחקן, קומיקאי, פזמונאי, במאי ותסריטאי ישראלי. נודע בשל תפקידו בסדרת הטלוויזיה \"הפיג'מות\" וגם בשל הסדרה אותה יצר וכתב, \"חצויה\".",
            "קובי פרג' (נולד ב-31 באוגוסט 1980, י\"ט באלול ה'תש\"ם בפתח תקווה) הוא שחקן, קומיקאי, מגיש רדיו, מפיק ובמאי קולנוע דוקומנטרי ישראלי. בין סרטיו \"פוטו פרג'\" (2016), אלבום פרטי (2018), \"להאיר את יוסי\" (2019),\"המלכה שושנה\" (2021) ו\"סרט בסנטר\" (2023). פרג' ידוע גם בשל יצירתו וכיכובו בקומדיית המצבים \"הפיג'מות\", \"תאג\"ד\" ו\"סברי מרנן\".",
            "נדב אסולין (נולד ב-9 בנובמבר 1971 בירושלים) הוא שחקן ישראלי.",
            "ניר רון (נולד ב-6 במרץ 1964) הוא שחקן ומדבב ישראלי.",
            "עודד משה פז (נולד ב-29 ביולי 1980) הוא שחקן, מנחה, מדבב, קומיקאי, במאי ומפיק ישראלי. ידוע בעיקר בשל השתתפותו בסדרת הילדים \"הפיג'מות\". הנחה בערוץ הילדים והפיק את המופע \"עודד פז והקסדות\".",
            "יניב (פולי) פולישוק (נולד ב-27 ביוני 1969) הוא שחקן, תסריטאי וקומיקאי ישראלי. הוא ידוע בעיקר בשל גילום דמותו של גרי מנדלבאום ב\"הפיג'מות\" וב\"מנדלבאום בלש פרטי\" וכאחד מיוצריה ושחקניה של \"סברי מרנן\".",
            "רבקה גור (נולדה ב-12 בינואר 1935) היא שחקנית תיאטרון, קולנוע וטלוויזיה, מחזאית וסופרת ישראלית. מהשחקניות הבולטות בתיאטרון הישראלי, ושנותיה על הבמה מתפרשות על פני שבעה עשורים.",
            "ימית סול (נולדה ב-1 בינואר 1982, ו' בטבת ה'תשמ\"ב) היא פסיכולוגית, שחקנית, מנחת טלוויזיה, תסריטאית, ודוגמנית ישראלית.",
            "ובל סגל (נולד ב-6 בדצמבר 1980, כ\"ח בכסלו ה'תשמ\"א) הוא שחקן, מדבב ותסריטאי ישראלי."};

}
